doc/dao-classes.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-07-17 Sat 15:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>DAO Classes</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Sabra Crolleton">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">DAO Classes</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#daos">Overview</a></li>
<li><a href="#class-dao-class">Metaclass dao-class</a>
<ul>
<li><a href="#orgeac445e">Basic Dao Definition Examples</a></li>
<li><a href="#class-dao-class-slots">Slot Options</a></li>
<li><a href="#class-dao-class-slots-table-options">Table options</a></li>
</ul>
</li>
<li><a href="#query-and-selection">Dao Query and Selection</a></li>
<li><a href="#dao-reference">Dao Reference</a>
<ul>
<li><a href="#dao-export-and-import-functions">Dao Export and Import Functions (Postmodern v. 1.33.1 and newer)</a></li>
<li><a href="#method-dao-keys-class">method dao-keys (class)</a></li>
<li><a href="#method-dao-keys-dao">method dao-keys (dao)</a></li>
<li><a href="#method-find-primary-key-column">method find-primary-key-column</a></li>
<li><a href="#method-dao-exists-p">method dao-exists-p (dao)</a></li>
<li><a href="#method-make-dao">method make-dao (type &amp;rest args &amp;key &amp;allow-other-keys)</a></li>
<li><a href="#method-fetch-defaults">method fetch-defaults (dao)</a></li>
<li><a href="#method-find-primary-key-column">method find-primary-key-column (class)</a></li>
<li><a href="#macro-define-dao-finalization">macro define-dao-finalization (((dao-name class) &amp;rest keyword-args) &amp;body body)</a></li>
<li><a href="#method-get-dao">method get-dao (type &amp;rest keys)</a></li>
<li><a href="#macro-select-dao">macro select-dao (type &amp;optional (test t) &amp;rest sort)</a></li>
<li><a href="#macro-do-select-dao">macro do-select-dao (((type type-var) &amp;optional (test t) &amp;rest sort) &amp;body body)</a></li>
<li><a href="#macro-query-dao">macro query-dao (type query &amp;rest args)</a></li>
<li><a href="#function-do-query-dao">function do-query-dao (((type type-var) query &amp;rest args) &amp;body body)</a></li>
<li><a href="#variable-ignore-unknown-columns">variable <code>*ignore-unknown-columns*</code></a></li>
<li><a href="#method-insert-dao">method insert-dao (dao)</a></li>
<li><a href="#method-update-dao">method update-dao (dao)</a></li>
<li><a href="#function-save-dao">function save-dao (dao)</a></li>
<li><a href="#function-save-dao-transaction">function save-dao/transaction (dao)</a></li>
<li><a href="#method-upsert-dao">method upsert-dao (dao)</a></li>
<li><a href="#method-delete-dao">method delete-dao (dao)</a></li>
<li><a href="#function-dao-table-name">function dao-table-name (class)</a></li>
<li><a href="#function-dao-table-definition">function dao-table-definition (class)</a></li>
<li><a href="#macro-with-column-writers">macro with-column-writers ((&amp;rest writers) &amp;body body)</a></li>
</ul>
</li>
<li><a href="#table-definition">Table definition and creation using a dao</a>
<ul>
<li><a href="#macro-deftable">macro deftable (name &amp;body definition)</a></li>
<li><a href="#variable-table-name">variable <code>*table-name*</code></a></li>
<li><a href="#variable-table-symbol">variable <code>*table-symbol*</code></a></li>
<li><a href="#function-_dao-def">function !dao-def ()</a></li>
<li><a href="#function-_index">function !index (&amp;rest columns), !unique-index (&amp;rest columns)</a></li>
<li><a href="#function-_foreign">function !foreign (target fields &amp;rest target-fields/on-delete/on-update/deferrable/initially-deferred)</a></li>
<li><a href="#function-_unique">function !unique (target-fields &amp;key deferrable initially-deferred)</a></li>
<li><a href="#function-create-table">function create-table (symbol)</a></li>
<li><a href="#function-create-all-tables">function create-all-tables ()</a></li>
<li><a href="#function-create-package-tables">function create-package-tables (package)</a></li>
<li><a href="#variable-table-name">variables <code>*table-name*</code>, <code>*table-symbol*</code></a></li>
<li><a href="#function-drop-table">function drop-table (table-name &amp;key if-exists cascade)</a></li>
</ul>
</li>
<li><a href="#out-of-sync-dao-objects">Out of Sync Dao Objects</a></li>
<li><a href="#multi-table-dao-class-object">Introduction to Multi-table dao class objects</a>
<ul>
<li>
<ul>
<li><a href="#multi-table-dao-class-object-simple-version">Simple Version</a></li>
<li><a href="#multi-table-dao-class-object-less-simple-version">Less Simple Version</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-daos" class="outline-2">
<h2 id="daos">Overview</h2>
<div class="outline-text-2" id="text-daos">
<p>
You can work directly with the database or you can use a simple
database-access-class (aka dao) which would cover all the fields in a row.
</p>

<p>
Postmodern allows you to have a relatively simple but straight forward matching
of clos classes to a database table. In its simplest form, a dao object would contain
the values of the rows of a database table. This is not intended as a full-fledged
object-relational magic system ― while serious ORM systems have their place, they
are notoriously hard to get right, and are outside of the scope of a humble SQL
library like this.
</p>

<p>
At the heart of Postmodern's DAO system is the dao-class metaclass. It allows you to
define classes for your database-access objects as regular CLOS classes. Some of the
slots in these classes will refer to columns in the database.
</p>
</div>
</div>
