doc/dao-classes.org
** Basic Dao Definition Examples
A simple dao definition could look like this:
#+BEGIN_SRC lisp
      (defclass users ()
        ((name :col-type string :initarg :name :accessor name)
         (creditcard :col-type (or db-null integer) :initarg :card :col-default :null)
         (score :col-type bigint :col-default 0 :accessor score)
         (payment-history :col-type (or (array integer) db-null)
                          :initarg :payment-history :accessor payment-history))
        (:metaclass dao-class)
        (:keys name))
#+END_SRC
In this case the name of the users will be treated as the primary key (the :keys
parameter at the end) and the database table is assumed to be named users because
that is the name of the class and there was no :table-name parameter provided.
(It might be worth noting that "user" is a reserved word for Postgresql and using
reserved words, while possible using quotes, is generally not worth the additional
trouble they cause.)

In our example, the name and score slots cannot be null because :col-type does not provide for db-null as an optiona. The creditcard slot can be null and actually defaults to null.
The :col-default :null specification ensures that the default in the database for
this field is null, but it does not bound the slot to a default form. Thus, making
an instance of the class without initializing this slot will leave it in an unbound
state.

The payment-history slot is matched to a Postgresql column named =payment_history=
(remember that Postgresql uses underscores rather than hyphens) and that Postgresql
column is an array of integers. If we wanted a two dimensional array of integers,
the col-type would look like:
#+begin_src lisp
:col-type (or (array (array integer)) db-null)
#+end_src
If the value contained in the Postgresql slot payment-history is a common lisp array,
Postmodern will seamless handle the conversion to and from the common lisp array and
the Postgresql array.

An example of a class where the keys are set as multiple column keys is here:
#+BEGIN_SRC lisp
  (defclass points ()
    ((x :col-type integer :initarg :x
        :reader point-x)
     (y :col-type integer :initarg :y
        :reader point-y)
     (value :col-type integer :initarg :value
            :accessor value))
    (:metaclass dao-class)
    (:keys x y))
#+END_SRC

In this case, retrieving a points record would look like the following where
12 and 34 would be the values you are looking to find in the x column and y
column respectively.:

#+BEGIN_SRC lisp
  (get-dao 'points 12 34)
#+END_SRC

Now look at a slightly more complex example.
#+BEGIN_SRC lisp
  (defclass country ()
    ((id :col-type integer :col-identity t :accessor id)
     (name :col-type string :col-unique t :check (:<> 'name "")
           :initarg :name :reader country-name)
     (inhabitants :col-type integer :initarg :inhabitants
                  :accessor country-inhabitants)
     (sovereign :col-type (or db-null string) :initarg :sovereign
                :accessor country-sovereign)
     (region-id :col-type integer :col-references ((regions id))
                :initarg :region-id :accessor region-id))
    (:documentation "Dao class for a countries record.")
    (:metaclass dao-class)
    (:table-name countries))
#+END_SRC
In this example we have an id column which is specified to be an identity column.
Postgresql will automatically generate a sequence of of integers and this will
be the primary key.

We have a name column which is specified as unique and is not null.

We have a region-id column which references the id column in the regions table.
This is a foreign key constraint and Postgresql will not accept inserting a
country into the database unless there is an existing region table with an id
that matches this number. Postgresql will also not allow deleting a region if
there are countries that reference that region's id. If we wanted Postgresql to
delete countries when regions are deleted, that column would be specified as:
#+BEGIN_SRC lisp
  (region-id :col-type integer :col-references ((regions id) :cascade)
             :initarg :region-id :accessor region-id)
#+END_SRC
Now you can see why the double parens.

We also specified that the table name is not "country" but "countries".
(Some style guides recommend that table names be plural and references to rows
be singular.) NOTE: You can provide a fully qualified table name. In other words,
if you have
#+begin_src lisp
(:table-name a.countries)
#+end_src
Postmodern will look for the countries table in the "A" schema.

When inheriting from DAO classes, a subclass' set of columns also contains all
the columns of its superclasses. The primary key for such a class is the union
of its own keys and all the keys from its superclasses. Classes inheriting from
DAO classes should probably always use the dao-class metaclass themselves.

When a DAO is created with make-instance, the :fetch-defaults keyword argument
can be passed, which, when T, will cause a query to fetch the default values for
all slots that refers to columns with defaults and were not bound through
initargs. In some cases, such as serial and identity columns, which have an
implicit default, this will not work. You can work around this by creating
your own sequence, e.g. "my_sequence", and defining a (:nextval "my_sequence")
default.

Finally, DAO class slots can have an option :ghost t to specify them as ghost
slots. These are selected when retrieving instances, but not written when
updating or inserting, or even included in the table definition. The only known
use for this to date is for creating the table with (oids=true), and specify a
slot like this:
#+BEGIN_SRC lisp
  (oid :col-type integer :ghost t :accessor get-oid)
#+END_SRC

