doc/dao-classes.org
** Slot Options
:PROPERTIES:
:CUSTOM_ID: class-dao-class-slots
:END:
The slot definitions in a table have several additional optional keyword parameters:

- :col-type
  To specify that a slot refers to a column, give it a :col-type option containing
  an S-SQL type expression (useful if you want to be able to derive a table
  definition from the class definition). The (or db-null integer) form is used to
  indicate a column can have NULL values otherwise the column will be treated as NOT NULL.

- :col-default
  When using  =dao-table-definition=, having :col-default in a slot definition will
  tell Postgresql to use this default value if no value is provided when inserting
  a new row. In the following example, Postgresql would insert the default value
  of 12 if no value was provided when inserting a new row.
  #+begin_src lisp
  (defclass col-default ()
    ((id :col-type integer :col-identity t :accessor id)
     (name :col-type text :col-unique t :col-check (:<> 'name "")
           :initarg :name :accessor name :col-collate "de_DE.utf8")
     (data :col-type integer :col-default 12 :accessor data
           :initarg :data))
    (:metaclass dao-class)
    (:table-name col-default))
  #+end_src

- :col-identity
  Often used for an id slot when you are going to define a Postgresql table by
  referring to this dao and you want the primary key to be an identity column automatically
  generated by Postgresql. This column must have a :col-type integer.

- :col-primary-key
  When using  =dao-table-definition=, specifying :col-primary-key in a slot
  definition will tell Postgresql that this column is the primary key for the
  table. You will also need to set :unique to t for this column. In the
  following example, the username is the primary key, not the id column.
  #+begin_src lisp
    (defclass test-data-col-primary-key ()
      ((id :col-type integer  :accessor id)
       (username :col-type text :col-primary-key t :col-unique t  :initarg :username :accessor username)
       (department-id :col-type integer :initarg :department-id :accessor department-id))
      (:metaclass dao-class)
      (:table-name users1))
  #+end_src

- :col-unique
  When you want to specify that the values in the table column associated with
  this slot must be unique. See an example in the username slot definition in
  the discussion of :col-primary-key immediately above.

- :col-export
  Specifies a function name to be called when you have to convert a slot value
  from a CL datatype to a Postgresql datatype that Postmodern does not automatically handle.
  More about this [[file:postmodern.html#dao-export-and-import-functions][below]].

- :col-import
  Specifies a function name to be called when you have to convert a slot value
  from a Postgresql datatype to a CL datatype that Postmodern does not automatically handle.
  More about this [[file:postmodern.html#dao-export-and-import-functions][below]].

- :col-name
  You can use the :col-name initarg (whose unevaluated value will be passed to to-sql-name)
  to specify the slot's column's name. In other words, you want a slot name that is different from the database table's column name. This tells Postmodern what that database table column's name when getting data from a table. This is NOT used in =dao-table-definition= in creating tables.

  #+begin_src lisp
    (defclass test-col-name ()
      ((a :col-type string :col-name aa :initarg :a :accessor test-a)
       (b :col-type string :col-name bb :initarg :b :accessor test-b)
       (c :col-type string              :initarg :c :accessor test-c)
       (from :col-type string :col-name from :initarg :d :accessor test-d)
       (to-destination :col-type string :col-name to :initarg :e :accessor test-e))
      (:metaclass dao-class)
      (:keys a))
  #+end_src

- :col-collate
  When using  =dao-table-definition=, having :col-collate in a slot definition will
  tell Postgresql to use this collation when sorting this column. You can have
  different collations in different columns of the same table. In the following
  example, Postgresql would use a German UTF8 collation in the name column.
#+begin_src lisp
  (defclass col-collate ()
    ((id :col-type integer :col-identity t :accessor id)
     (name :col-type text :col-unique t :col-check (:<> 'name "")
           :initarg :name :accessor name :col-collate "de_DE.utf8")
    (:metaclass dao-class)
    (:table-name col-collate))
#+end_src

- :col-check
  When using  =dao-table-definition=, having :col-check in a slot definition will
  tell Postgresql to ensure that any data entered into that column must meet
  certain requirements. In the following example, Postgresql would ensure
  that values in the name column can never be an empty string.
  #+begin_src lisp
  (defclass col-check ()
    ((id :col-type integer :col-identity t :accessor id)
     (name :col-type text :col-unique t :col-check (:<> 'name "")
           :initarg :name :accessor name :col-collate "de_DE.utf8")
    (:metaclass dao-class)
    (:table-name col-check))
  #+end_src

- :col-references
  This specifies that the column references a column in another table.
  In the following example, the department-id slot references the id column in
  the departments table:
  #+begin_src lisp
    (defclass test-data-col-identity-with-references ()
      ((id :col-type integer :col-identity t :accessor id :col-primary-key t)
       (username :col-type text :unique t :initarg :username :accessor username)
       (department-id :col-type integer :col-references ((departments id))
                      :initarg :department-id :accessor department-id))
      (:metaclass dao-class)
      (:table-name usersr))
  #+end_src

- :col-
