doc/dao-classes.html

<div id="outline-container-class-dao-class-slots" class="outline-3">
<h3 id="class-dao-class-slots">Slot Options</h3>
<div class="outline-text-3" id="text-class-dao-class-slots">
<p>
The slot definitions in a table have several additional optional keyword parameters:
</p>

<ul class="org-ul">
<li>:col-type
To specify that a slot refers to a column, give it a :col-type option containing
an S-SQL type expression (useful if you want to be able to derive a table
definition from the class definition). The (or db-null integer) form is used to
indicate a column can have NULL values otherwise the column will be treated as NOT NULL.</li>

<li><p>
:col-default
When using  <code>dao-table-definition</code>, having :col-default in a slot definition will
tell Postgresql to use this default value if no value is provided when inserting
a new row. In the following example, Postgresql would insert the default value
of 12 if no value was provided when inserting a new row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">col-default</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-identity</span> t <span style="color: #23d7d7;">:accessor</span> id)
   (name <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:col-unique</span> t <span style="color: #23d7d7;">:col-check</span> (<span style="color: #23d7d7;">:&lt;&gt;</span> 'name <span style="color: #e67128;">""</span>)
         <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span> <span style="color: #23d7d7;">:accessor</span> name <span style="color: #23d7d7;">:col-collate</span> <span style="color: #e67128;">"de_DE.utf8"</span>)
   (data <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-default</span> 12 <span style="color: #23d7d7;">:accessor</span> data
         <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:data</span>))
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:table-name</span> col-default))
</pre>
</div></li>

<li>:col-identity
Often used for an id slot when you are going to define a Postgresql table by
referring to this dao and you want the primary key to be an identity column automatically
generated by Postgresql. This column must have a :col-type integer.</li>

<li><p>
:col-primary-key
When using  <code>dao-table-definition</code>, specifying :col-primary-key in a slot
definition will tell Postgresql that this column is the primary key for the
table. You will also need to set :unique to t for this column. In the
following example, the username is the primary key, not the id column.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">test-data-col-primary-key</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer  <span style="color: #23d7d7;">:accessor</span> id)
   (username <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:col-primary-key</span> t <span style="color: #23d7d7;">:col-unique</span> t  <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:username</span> <span style="color: #23d7d7;">:accessor</span> username)
   (department-id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:department-id</span> <span style="color: #23d7d7;">:accessor</span> department-id))
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:table-name</span> users1))
</pre>
</div></li>

<li>:col-unique
When you want to specify that the values in the table column associated with
this slot must be unique. See an example in the username slot definition in
the discussion of :col-primary-key immediately above.</li>

<li>:col-export
Specifies a function name to be called when you have to convert a slot value
from a CL datatype to a Postgresql datatype that Postmodern does not automatically handle.
More about this <a href="postmodern.html#dao-export-and-import-functions">below</a>.</li>

<li>:col-import
Specifies a function name to be called when you have to convert a slot value
from a Postgresql datatype to a CL datatype that Postmodern does not automatically handle.
More about this <a href="postmodern.html#dao-export-and-import-functions">below</a>.</li>

<li><p>
:col-name
You can use the :col-name initarg (whose unevaluated value will be passed to to-sql-name)
to specify the slot's column's name. In other words, you want a slot name that is different from the database table's column name. This tells Postmodern what that database table column's name when getting data from a table. This is NOT used in <code>dao-table-definition</code> in creating tables.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">test-col-name</span> ()
  ((a <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:col-name</span> aa <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:a</span> <span style="color: #23d7d7;">:accessor</span> test-a)
   (b <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:col-name</span> bb <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:b</span> <span style="color: #23d7d7;">:accessor</span> test-b)
   (c <span style="color: #23d7d7;">:col-type</span> string              <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:c</span> <span style="color: #23d7d7;">:accessor</span> test-c)
   (from <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:col-name</span> from <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:d</span> <span style="color: #23d7d7;">:accessor</span> test-d)
   (to-destination <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:col-name</span> to <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:e</span> <span style="color: #23d7d7;">:accessor</span> test-e))
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:keys</span> a))
</pre>
</div></li>

<li>:col-collate
When using  <code>dao-table-definition</code>, having :col-collate in a slot definition will
tell Postgresql to use this collation when sorting this column. You can have
different collations in different columns of the same table. In the following
example, Postgresql would use a German UTF8 collation in the name column.</li>
</ul>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">col-collate</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-identity</span> t <span style="color: #23d7d7;">:accessor</span> id)
   (name <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:col-unique</span> t <span style="color: #23d7d7;">:col-check</span> (<span style="color: #23d7d7;">:&lt;&gt;</span> 'name <span style="color: #e67128;">""</span>)
         <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span> <span style="color: #23d7d7;">:accessor</span> name <span style="color: #23d7d7;">:col-collate</span> <span style="color: #e67128;">"de_DE.utf8"</span>)
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:table-name</span> col-collate))
</pre>
</div>

<ul class="org-ul">
<li><p>
:col-check
When using  <code>dao-table-definition</code>, having :col-check in a slot definition will
tell Postgresql to ensure that any data entered into that column must meet
certain requirements. In the following example, Postgresql would ensure
that values in the name column can never be an empty string.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">col-check</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-identity</span> t <span style="color: #23d7d7;">:accessor</span> id)
   (name <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:col-unique</span> t <span style="color: #23d7d7;">:col-check</span> (<span style="color: #23d7d7;">:&lt;&gt;</span> 'name <span style="color: #e67128;">""</span>)
         <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span> <span style="color: #23d7d7;">:accessor</span> name <span style="color: #23d7d7;">:col-collate</span> <span style="color: #e67128;">"de_DE.utf8"</span>)
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:table-name</span> col-check))
</pre>
</div></li>

<li><p>
:col-references
This specifies that the column references a column in another table.
In the following example, the department-id slot references the id column in
the departments table:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">test-data-col-identity-with-references</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-identity</span> t <span style="color: #23d7d7;">:accessor</span> id <span style="color: #23d7d7;">:col-primary-key</span> t)
   (username <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:unique</span> t <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:username</span> <span style="color: #23d7d7;">:accessor</span> username)
   (department-id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-references</span> ((departments id))
                  <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:department-id</span> <span style="color: #23d7d7;">:accessor</span> department-id))
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:table-name</span> usersr))
</pre>
</div></li>

<li>:col-</li>
</ul>
</div>
</div>
