doc/dao-classes.org
** Table options
:PROPERTIES:
:CUSTOM_ID: class-dao-class-slots-table-options
:END:
DAO class definitions support two extra class options: :table-name to give the
name of the table that the class refers to (defaults to the class name),
and :keys to provide a set of primary keys for the table if they have not been
specified in a single column. If more than one key is provided, this creates a
multi-column primary key and all keys must be specified when using operations
such as update-dao and get-dao. When no primary keys are defined, operations
such as update-dao and get-dao will not work.

IMPORTANT: Class finalization for a dao class instance are wrapped with a thread
lock. However, any time you are using threads and a class that inherits from
other classes, you should ensure that classes are finalized before you start
generating threads that create new instances of that class.


* Dao Query and Selection
:PROPERTIES:
:CUSTOM_ID: query-and-selection
:END:
The base query and selection methods and macros are:

- [[#method-get-dao][get-dao]] A method that create an instance of a dao object class based on a query of the rows of a database table based on its primary keys.
- [[#macro-select-dao][select-dao]]: A macro to select dao objects for the rows in the associated table for which the given test (either an S-SQL expression or a string) holds. When sorting arguments are given, which can also be S-SQL forms or strings, these are used to sort the result.
- [[#macro-do-select-dao][do-select-dao]]: A macro like =select-dao= but iterates over the results rather than returning them.
- [[#macro-query-dao][query-dao]]: A macro that executes a given query and returns the results as daos of a given type.
- [[#function-do-query-dao][do-query-dao]]: A function which operates like =query-dao= but iterates over the results rather than returning them.
* Dao Reference
:PROPERTIES:
:CUSTOM_ID: dao-reference
:END:

** Dao Export and Import Functions (Postmodern v. 1.33.1 and newer)
   :PROPERTIES:
   :CUSTOM_ID: dao-export-and-import-functions
   :END:
There may be times when the types of values in a dao slot do not have comparable types in Postgresql. For purposes of the following example, assume you have slots that you want to contain lists. Postgresql does not have a "list" data type. Postgresql arrays must be homogeneous but CL lists do not have that limitation. What to do?

One method would be to use text columns or jsonb columns in Postgresql and have functions that convert as necessary going back and forth. In the following example we will use text columns in Postgresql and write CL list data to string when we "export" the data to Postgresql and then convert from string when we "import" the data from Postgresql into a dao-class instance.

Consider the following dao-class definition. We have added additional column keyword parameters :col-export and :col-import. These parameters refer to functions which will convert the values from that slot to a valid Postgresql type (in our example, a string) on export to the database and from that Postgresql type to the type we want in this slot on import from the database.

To make things slightly more interesting, we have two slots which are going to contain
lists, but one will export to a Postgresql column that contains strings and the other
will export to a Postgresql column that contains arrays of integers.
#+begin_src lisp
  (defclass listy ()
    ((id :col-type integer :col-identity t :accessor id :col-primary-key t)
     (name :col-type text :col-unique t :col-check (:<> 'name "")
           :initarg :name :accessor name)
     (r-list :col-type (or text db-null) :initarg :r-list :accessor r-list
             :col-export list->string :col-import string->list)
     (l-array :col-type (or (array integer) db-null)
              :initarg :l-array :accessor l-array
              :col-export list->arr :col-import array->list))
    (:metaclass dao-class)
    (:table-name listy))
#+end_src
Now we are going to define the import functions. When writing your import functions, pay attention to how you want to handle nil or :NULL values as well as how you might want to error check the conversion from a Postgresql datatype to a CL datatype. Just to show some of the
differences, we are going to translate :NULL strings in Postgresql to :NULL in common lisp
and we are going to translate :NULL arrays in Postgresql to nil in common lisp.
#+begin_src lisp
  (defun string->list (str)
    "Take a string representation of a list and return a lisp list.
    Note that you need to handle :NULLs."
    (cond ((eq str :NULL)
           :NULL)
          (str
           (with-input-from-string (s str) (read s)))
          (t nil)))

  (defun array->list (arry)
    "Here we have decided that we want the list be be nil rather than :NULL if the array is empty."
    (cond ((eq arry :NULL)
           nil)
          ((vectorp arry)
           (coerce arry 'list))
          (t nil)))
#+end_src
And now the export functions. In our example we are just going to be using format to write the CL value to a string unless it is not a list. You are responsible for writing an export function that does what you need. This example just tells Postgresql to insert :NULL if the slot value is not a list. In real life you would need more error checking and condition handling.

The list to array export function inserts :NULL if not a list and otherwise coerces the
list to a vector so that Postgresql will accept it as an array.
#+begin_src lisp
  (defun list->string (lst)
    "Here we have decided to insert :null if the input list is nil."
    (if (listp lst)
        (format nil "~a" lst)
        :null))

  (defun list->arr (lst)
    (if (null lst)
        :null
        (coerce lst 'vector)))
#+end_src

