doc/dao-classes.html
<div id="outline-container-class-dao-class-slots-table-options" class="outline-3">
<h3 id="class-dao-class-slots-table-options">Table options</h3>
<div class="outline-text-3" id="text-class-dao-class-slots-table-options">
<p>
DAO class definitions support two extra class options: :table-name to give the
name of the table that the class refers to (defaults to the class name),
and :keys to provide a set of primary keys for the table if they have not been
specified in a single column. If more than one key is provided, this creates a
multi-column primary key and all keys must be specified when using operations
such as update-dao and get-dao. When no primary keys are defined, operations
such as update-dao and get-dao will not work.
</p>

<p>
IMPORTANT: Class finalization for a dao class instance are wrapped with a thread
lock. However, any time you are using threads and a class that inherits from
other classes, you should ensure that classes are finalized before you start
generating threads that create new instances of that class.
</p>
</div>
</div>
</div>


<div id="outline-container-query-and-selection" class="outline-2">
<h2 id="query-and-selection">Dao Query and Selection</h2>
<div class="outline-text-2" id="text-query-and-selection">
<p>
The base query and selection methods and macros are:
</p>

<ul class="org-ul">
<li><a href="#method-get-dao">get-dao</a> A method that create an instance of a dao object class based on a query of the rows of a database table based on its primary keys.</li>
<li><a href="#macro-select-dao">select-dao</a>: A macro to select dao objects for the rows in the associated table for which the given test (either an S-SQL expression or a string) holds. When sorting arguments are given, which can also be S-SQL forms or strings, these are used to sort the result.</li>
<li><a href="#macro-do-select-dao">do-select-dao</a>: A macro like <code>select-dao</code> but iterates over the results rather than returning them.</li>
<li><a href="#macro-query-dao">query-dao</a>: A macro that executes a given query and returns the results as daos of a given type.</li>
<li><a href="#function-do-query-dao">do-query-dao</a>: A function which operates like <code>query-dao</code> but iterates over the results rather than returning them.</li>
</ul>
</div>
</div>
<div id="outline-container-dao-reference" class="outline-2">
<h2 id="dao-reference">Dao Reference</h2>
<div class="outline-text-2" id="text-dao-reference">
</div>

<div id="outline-container-dao-export-and-import-functions" class="outline-3">
<h3 id="dao-export-and-import-functions">Dao Export and Import Functions (Postmodern v. 1.33.1 and newer)</h3>
<div class="outline-text-3" id="text-dao-export-and-import-functions">
<p>
There may be times when the types of values in a dao slot do not have comparable types in Postgresql. For purposes of the following example, assume you have slots that you want to contain lists. Postgresql does not have a "list" data type. Postgresql arrays must be homogeneous but CL lists do not have that limitation. What to do?
</p>

<p>
One method would be to use text columns or jsonb columns in Postgresql and have functions that convert as necessary going back and forth. In the following example we will use text columns in Postgresql and write CL list data to string when we "export" the data to Postgresql and then convert from string when we "import" the data from Postgresql into a dao-class instance.
</p>

<p>
Consider the following dao-class definition. We have added additional column keyword parameters :col-export and :col-import. These parameters refer to functions which will convert the values from that slot to a valid Postgresql type (in our example, a string) on export to the database and from that Postgresql type to the type we want in this slot on import from the database.
</p>

<p>
To make things slightly more interesting, we have two slots which are going to contain
lists, but one will export to a Postgresql column that contains strings and the other
will export to a Postgresql column that contains arrays of integers.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">listy</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-identity</span> t <span style="color: #23d7d7;">:accessor</span> id <span style="color: #23d7d7;">:col-primary-key</span> t)
   (name <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:col-unique</span> t <span style="color: #23d7d7;">:col-check</span> (<span style="color: #23d7d7;">:&lt;&gt;</span> 'name <span style="color: #e67128;">""</span>)
         <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span> <span style="color: #23d7d7;">:accessor</span> name)
   (r-list <span style="color: #23d7d7;">:col-type</span> (or text db-null) <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:r-list</span> <span style="color: #23d7d7;">:accessor</span> r-list
           <span style="color: #23d7d7;">:col-export</span> list-&gt;string <span style="color: #23d7d7;">:col-import</span> string-&gt;list)
   (l-array <span style="color: #23d7d7;">:col-type</span> (or (array integer) db-null)
            <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:l-array</span> <span style="color: #23d7d7;">:accessor</span> l-array
            <span style="color: #23d7d7;">:col-export</span> list-&gt;arr <span style="color: #23d7d7;">:col-import</span> array-&gt;list))
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:table-name</span> listy))
</pre>
</div>
<p>
Now we are going to define the import functions. When writing your import functions, pay attention to how you want to handle nil or :NULL values as well as how you might want to error check the conversion from a Postgresql datatype to a CL datatype. Just to show some of the
differences, we are going to translate :NULL strings in Postgresql to :NULL in common lisp
and we are going to translate :NULL arrays in Postgresql to nil in common lisp.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">string-&gt;list</span> (str)
  <span style="color: #e67128;">"Take a string representation of a list and return a lisp list.</span>
<span style="color: #e67128;">  Note that you need to handle :NULLs."</span>
  (<span style="color: #ffad29; font-weight: bold;">cond</span> ((eq str <span style="color: #23d7d7;">:NULL</span>)
         <span style="color: #23d7d7;">:NULL</span>)
        (str
         (<span style="color: #ffad29; font-weight: bold;">with-input-from-string</span> (s str) (read s)))
        (t nil)))

(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">array-&gt;list</span> (arry)
  <span style="color: #e67128;">"Here we have decided that we want the list be be nil rather than :NULL if the array is empty."</span>
  (<span style="color: #ffad29; font-weight: bold;">cond</span> ((eq arry <span style="color: #23d7d7;">:NULL</span>)
         nil)
        ((vectorp arry)
         (coerce arry 'list))
        (t nil)))
</pre>
</div>
<p>
And now the export functions. In our example we are just going to be using format to write the CL value to a string unless it is not a list. You are responsible for writing an export function that does what you need. This example just tells Postgresql to insert :NULL if the slot value is not a list. In real life you would need more error checking and condition handling.
</p>

<p>
The list to array export function inserts :NULL if not a list and otherwise coerces the
list to a vector so that Postgresql will accept it as an array.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">list-&gt;string</span> (lst)
  <span style="color: #e67128;">"Here we have decided to insert :null if the input list is nil."</span>
  (<span style="color: #ffad29; font-weight: bold;">if</span> (listp lst)
      (format nil <span style="color: #e67128;">"~a"</span> lst)
      <span style="color: #23d7d7;">:null</span>))

(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">list-&gt;arr</span> (lst)
  (<span style="color: #ffad29; font-weight: bold;">if</span> (null lst)
      <span style="color: #23d7d7;">:null</span>
      (coerce lst 'vector)))
</pre>
</div>
</div>
</div>
