doc/dao-classes.org
** method dao-keys (class)
:PROPERTIES:
:CUSTOM_ID: method-dao-keys-class
:END:
→ list

Returns list of slot names that are the primary key of DAO class. This is likely
interesting if you have primary keys which are composed of more than one slot.
Pay careful attention to situations where the primary key not only has more than
one column, but they are actually in a different order than they are in the
database table itself. You can check this with the internal
find-primary-key-info function. Obviously the table needs to have been defined.
The class must be quoted.
#+BEGIN_SRC lisp
  (pomo:find-primary-key-info 'country1)

  (("name" "text") ("id" "integer"))
#+END_SRC

** method dao-keys (dao)
:PROPERTIES:
:CUSTOM_ID: method-dao-keys-dao
:END:
→ list

Returns list of values that are the primary key of dao. Explicit keys takes
priority over col-identity which takes priority over col-primary-key.

This is likely interesting if you have primary keys which are composed of
more than one slot. Pay careful attention to situations where the primary key
not only has more than one column, but they are actually in a different order
than they are in the database table itself.  Obviously the table needs to have
been defined. You can provide a quoted class-name or an instance of a dao.

** method find-primary-key-column
:PROPERTIES:
:CUSTOM_ID: method-find-primary-key-column
:END:
→ symbol

Loops through a class's column definitions and returns the first column name
that has bound either col-identity or col-primary-key.

** method dao-exists-p (dao)
:PROPERTIES:
:CUSTOM_ID: method-dao-exists-p
:END:
→ boolean

Test whether a row with the same primary key as the given dao exists in the
database. Will also return NIL when any of the key slots in the object are
unbound.

** method make-dao (type &rest args &key &allow-other-keys)
:PROPERTIES:
:CUSTOM_ID: method-make-dao
:END:
→ dao

Combines make-instance with insert-dao. Make the instance of the given class and
insert it into the database, returning the created dao.

** method fetch-defaults (dao)
:PROPERTIES:
:CUSTOM_ID: method-fetch-defaults
:END:
→ dao if there were unbound slots with default values, otherwise nil

Used to fetch the default values of an object on creation.
An example would be creating a dao object with unbounded slots.
Fetch-defaults could then be used to fetch the default values from the database
and bind the unbound slots which have default values. E.g.
#+BEGIN_SRC lisp
  (let ((dao (make-instance 'test-data :a 23)))
    (pomo:fetch-defaults dao))
#+END_SRC
** method find-primary-key-column (class)
:PROPERTIES:
:CUSTOM_ID: method-find-primary-key-column
:END:
→ symbol

Loops through a class's column definitions and returns
the first column name that has bound either col-identity or col-primary-key.
Returns a symbol.

** macro define-dao-finalization (((dao-name class) &rest keyword-args) &body body)
:PROPERTIES:
:CUSTOM_ID: macro-define-dao-finalization
:END:

Create an :around-method for make-dao. The body is executed in a lexical
environment where dao-name is bound to a freshly created and inserted DAO. The
representation of the DAO in the database is then updated to reflect changes
that body might have introduced. Useful for processing values of slots with the
type serial, which are unknown before insert-dao.

** method get-dao (type &rest keys)
:PROPERTIES:
:CUSTOM_ID: method-get-dao
:END:
→ dao

Get the single DAO object from the row that has the given primary key values, or NIL
if no such row exists. Objects created by this function will have
initialize-instance called on them (after loading in the values from the
database) without any arguments ― even :default-initargs are skipped. The same
goes for select-dao and query-dao.
#+BEGIN_SRC lisp
  (get-dao 'country "The Netherlands")
  #<COUNTRY {1010F0DCF3}>
#+END_SRC

From an sql perspective, the standard call to get-dao translates as:
#+BEGIN_SRC sql
select * from table
#+END_SRC

NOTE: if you have added fields to the database table without updating the class
definition, get-dao and select-dao will throw errors. This may cause your
application to appear to hang unless you have the necessary condition handling
in your code. Usually this will only happen during development, so throwing an
error is not a bad idea. If you want to ignore the errors,
set =*ignore-unknown-columns*= to t.

** macro select-dao (type &optional (test t) &rest sort)
   :PROPERTIES:
   :CUSTOM_ID: macro-select-dao
   :END:
→ list

Select DAO objects for the rows in the associated table for which the given
test (either an S-SQL expression or a string) holds. When sorting arguments are
given, which can also be S-SQL forms or strings, these are used to sort the
result.

(Note that, if you want to sort, you have to pass the test argument.)
#+BEGIN_SRC lisp
(select-dao 'country)
(#<COUNTRY {101088F6F3}> #<COUNTRY {101088FAA3}>)
2

(select-dao 'country (:> 'inhabitants 50000000))
NIL
0

(select-dao 'country (:> 'inhabitants 5000000))
(#<COUNTRY {10108AD293}>)
1

(select-dao 'country (:> 'inhabitants 5000))
(#<COUNTRY {10108CA773}> #<COUNTRY {10108CAB23}>)
2

(select-dao 'country (:> 'inhabitants 5000) 'name) ;sorted by name
(#<COUNTRY {10108EF423}> #<COUNTRY {10108EF643}>)

(mapcar 'country-name (select-dao 'country (:> 'inhabitants 5000) 'name))
("Croatia" "The Netherlands")

(mapcar 'country-name (select-dao 'country (:> 'inhabitants 5000)))
("The Netherlands" "Croatia")
#+END_SRC
If for some reason, you wanted the list in reverse alphabetical order, then:
#+BEGIN_SRC lisp
(select-dao 'country (:> 'id  0) (:desc 'name))
#+END_SRC
** macro do-select-dao (((type type-var) &optional (test t) &rest sort) &body body)
   :PROPERTIES:
   :CUSTOM_ID: macro-do-select-dao
   :END:

Like select-dao, but iterates over the results rather than returning them.
For each matching DAO, body is evaluated with type-var bound to the DAO
instance.

Example:
#+BEGIN_SRC lisp
(do-select-dao (('user user) (:> 'score 10000) 'name)
  (pushnew user high-scorers))
#+END_SRC

