doc/dao-classes.html

<div id="outline-container-method-dao-keys-class" class="outline-3">
<h3 id="method-dao-keys-class">method dao-keys (class)</h3>
<div class="outline-text-3" id="text-method-dao-keys-class">
<p>
→ list
</p>

<p>
Returns list of slot names that are the primary key of DAO class. This is likely
interesting if you have primary keys which are composed of more than one slot.
Pay careful attention to situations where the primary key not only has more than
one column, but they are actually in a different order than they are in the
database table itself. You can check this with the internal
find-primary-key-info function. Obviously the table needs to have been defined.
The class must be quoted.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(pomo:find-primary-key-info 'country1)

((<span style="color: #e67128;">"name"</span> <span style="color: #e67128;">"text"</span>) (<span style="color: #e67128;">"id"</span> <span style="color: #e67128;">"integer"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-method-dao-keys-dao" class="outline-3">
<h3 id="method-dao-keys-dao">method dao-keys (dao)</h3>
<div class="outline-text-3" id="text-method-dao-keys-dao">
<p>
→ list
</p>

<p>
Returns list of values that are the primary key of dao. Explicit keys takes
priority over col-identity which takes priority over col-primary-key.
</p>

<p>
This is likely interesting if you have primary keys which are composed of
more than one slot. Pay careful attention to situations where the primary key
not only has more than one column, but they are actually in a different order
than they are in the database table itself.  Obviously the table needs to have
been defined. You can provide a quoted class-name or an instance of a dao.
</p>
</div>
</div>

<div id="outline-container-method-find-primary-key-column" class="outline-3">
<h3 id="method-find-primary-key-column">method find-primary-key-column</h3>
<div class="outline-text-3" id="text-method-find-primary-key-column">
<p>
→ symbol
</p>

<p>
Loops through a class's column definitions and returns the first column name
that has bound either col-identity or col-primary-key.
</p>
</div>
</div>

<div id="outline-container-method-dao-exists-p" class="outline-3">
<h3 id="method-dao-exists-p">method dao-exists-p (dao)</h3>
<div class="outline-text-3" id="text-method-dao-exists-p">
<p>
→ boolean
</p>

<p>
Test whether a row with the same primary key as the given dao exists in the
database. Will also return NIL when any of the key slots in the object are
unbound.
</p>
</div>
</div>

<div id="outline-container-method-make-dao" class="outline-3">
<h3 id="method-make-dao">method make-dao (type &amp;rest args &amp;key &amp;allow-other-keys)</h3>
<div class="outline-text-3" id="text-method-make-dao">
<p>
→ dao
</p>

<p>
Combines make-instance with insert-dao. Make the instance of the given class and
insert it into the database, returning the created dao.
</p>
</div>
</div>

<div id="outline-container-method-fetch-defaults" class="outline-3">
<h3 id="method-fetch-defaults">method fetch-defaults (dao)</h3>
<div class="outline-text-3" id="text-method-fetch-defaults">
<p>
→ dao if there were unbound slots with default values, otherwise nil
</p>

<p>
Used to fetch the default values of an object on creation.
An example would be creating a dao object with unbounded slots.
Fetch-defaults could then be used to fetch the default values from the database
and bind the unbound slots which have default values. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">let</span> ((dao (make-instance 'test-data <span style="color: #23d7d7;">:a</span> 23)))
  (pomo:fetch-defaults dao))
</pre>
</div>
</div>
</div>
<div id="outline-container-method-find-primary-key-column" class="outline-3">
<h3 id="method-find-primary-key-column">method find-primary-key-column (class)</h3>
<div class="outline-text-3" id="text-method-find-primary-key-column">
<p>
→ symbol
</p>

<p>
Loops through a class's column definitions and returns
the first column name that has bound either col-identity or col-primary-key.
Returns a symbol.
</p>
</div>
</div>

<div id="outline-container-macro-define-dao-finalization" class="outline-3">
<h3 id="macro-define-dao-finalization">macro define-dao-finalization (((dao-name class) &amp;rest keyword-args) &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-define-dao-finalization">
<p>
Create an :around-method for make-dao. The body is executed in a lexical
environment where dao-name is bound to a freshly created and inserted DAO. The
representation of the DAO in the database is then updated to reflect changes
that body might have introduced. Useful for processing values of slots with the
type serial, which are unknown before insert-dao.
</p>
</div>
</div>

<div id="outline-container-method-get-dao" class="outline-3">
<h3 id="method-get-dao">method get-dao (type &amp;rest keys)</h3>
<div class="outline-text-3" id="text-method-get-dao">
<p>
→ dao
</p>

<p>
Get the single DAO object from the row that has the given primary key values, or NIL
if no such row exists. Objects created by this function will have
initialize-instance called on them (after loading in the values from the
database) without any arguments ― even :default-initargs are skipped. The same
goes for select-dao and query-dao.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(get-dao 'country <span style="color: #e67128;">"The Netherlands"</span>)
#&lt;COUNTRY {1010F0DCF3}&gt;
</pre>
</div>

<p>
From an sql perspective, the standard call to get-dao translates as:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #ffad29; font-weight: bold;">select</span> * <span style="color: #ffad29; font-weight: bold;">from</span> <span style="color: #ffad29; font-weight: bold;">table</span>
</pre>
</div>

<p>
NOTE: if you have added fields to the database table without updating the class
definition, get-dao and select-dao will throw errors. This may cause your
application to appear to hang unless you have the necessary condition handling
in your code. Usually this will only happen during development, so throwing an
error is not a bad idea. If you want to ignore the errors,
set <code>*ignore-unknown-columns*</code> to t.
</p>
</div>
</div>

<div id="outline-container-macro-select-dao" class="outline-3">
<h3 id="macro-select-dao">macro select-dao (type &amp;optional (test t) &amp;rest sort)</h3>
<div class="outline-text-3" id="text-macro-select-dao">
<p>
→ list
</p>

<p>
Select DAO objects for the rows in the associated table for which the given
test (either an S-SQL expression or a string) holds. When sorting arguments are
given, which can also be S-SQL forms or strings, these are used to sort the
result.
</p>

<p>
(Note that, if you want to sort, you have to pass the test argument.)
</p>
<div class="org-src-container">
<pre class="src src-lisp">(select-dao 'country)
(#&lt;COUNTRY {101088F6F3}&gt; #&lt;COUNTRY {101088FAA3}&gt;)
2

(select-dao 'country (<span style="color: #23d7d7;">:&gt;</span> 'inhabitants 50000000))
NIL
0

(select-dao 'country (<span style="color: #23d7d7;">:&gt;</span> 'inhabitants 5000000))
(#&lt;COUNTRY {10108AD293}&gt;)
1

(select-dao 'country (<span style="color: #23d7d7;">:&gt;</span> 'inhabitants 5000))
(#&lt;COUNTRY {10108CA773}&gt; #&lt;COUNTRY {10108CAB23}&gt;)
2

(select-dao 'country (<span style="color: #23d7d7;">:&gt;</span> 'inhabitants 5000) 'name) <span style="color: #74af68;">;sorted by name</span>
(#&lt;COUNTRY {10108EF423}&gt; #&lt;COUNTRY {10108EF643}&gt;)

(mapcar 'country-name (select-dao 'country (<span style="color: #23d7d7;">:&gt;</span> 'inhabitants 5000) 'name))
(<span style="color: #e67128;">"Croatia"</span> <span style="color: #e67128;">"The Netherlands"</span>)

(mapcar 'country-name (select-dao 'country (<span style="color: #23d7d7;">:&gt;</span> 'inhabitants 5000)))
(<span style="color: #e67128;">"The Netherlands"</span> <span style="color: #e67128;">"Croatia"</span>)
</pre>
</div>
<p>
If for some reason, you wanted the list in reverse alphabetical order, then:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(select-dao 'country (<span style="color: #23d7d7;">:&gt;</span> 'id  0) (<span style="color: #23d7d7;">:desc</span> 'name))
</pre>
</div>
</div>
</div>
<div id="outline-container-macro-do-select-dao" class="outline-3">
<h3 id="macro-do-select-dao">macro do-select-dao (((type type-var) &amp;optional (test t) &amp;rest sort) &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-do-select-dao">
<p>
Like select-dao, but iterates over the results rather than returning them.
For each matching DAO, body is evaluated with type-var bound to the DAO
instance.
</p>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">do-select-dao</span> (('user user) (<span style="color: #23d7d7;">:&gt;</span> 'score 10000) 'name)
  (pushnew user high-scorers))
</pre>
</div>
</div>
</div>
