doc/dao-classes.html

<div id="outline-container-macro-query-dao" class="outline-3">
<h3 id="macro-query-dao">macro query-dao (type query &amp;rest args)</h3>
<div class="outline-text-3" id="text-macro-query-dao">
<p>
→ list of daos
</p>

<p>
Execute the given query (which can be either a string or an S-SQL expression)
and return the result as DAOs of the given type. If the query contains
placeholders ($1, $2, etc) their values can be given as extra arguments. The
names of the fields returned by the query must either match slots in the DAO
class, or be bound through with-column-writers.
</p>
</div>
</div>

<div id="outline-container-function-do-query-dao" class="outline-3">
<h3 id="function-do-query-dao">function do-query-dao (((type type-var) query &amp;rest args) &amp;body body)</h3>
<div class="outline-text-3" id="text-function-do-query-dao">
<p>
→ list of daos
</p>

<p>
Like query-dao, but iterates over the results rather than returning them.
For each matching DAO, body is evaluated with type-var bound to the instance.
</p>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">do-query-dao</span> (('user user) (<span style="color: #23d7d7;">:order-by</span> (<span style="color: #23d7d7;">:select</span> '* <span style="color: #23d7d7;">:from</span> 'user <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:&gt;</span> 'score 10000)) 'name))
  (pushnew user high-scorers))
</pre>
</div>
</div>
</div>

<div id="outline-container-variable-ignore-unknown-columns" class="outline-3">
<h3 id="variable-ignore-unknown-columns">variable <code>*ignore-unknown-columns*</code></h3>
<div class="outline-text-3" id="text-variable-ignore-unknown-columns">
<p>
Normally, when get-dao, select-dao, or query-dao finds a column in the database
that's not in the DAO class, it will raise an error. Setting this variable to a
non-NIL will cause it to simply ignore the unknown column. This allows you to create
daos which are subsets of a table.
</p>
</div>
</div>

<div id="outline-container-method-insert-dao" class="outline-3">
<h3 id="method-insert-dao">method insert-dao (dao)</h3>
<div class="outline-text-3" id="text-method-insert-dao">
<p>
→ dao
</p>

<p>
Insert the given dao into the database. Column slots of the object which are
unbound implies the database defaults. Hence, if these columns has no defaults
defined in the database, the the insertion of the dao will be failed. (This
feature only works on PostgreSQL 8.2 and up.)
</p>
</div>
</div>

<div id="outline-container-method-update-dao" class="outline-3">
<h3 id="method-update-dao">method update-dao (dao)</h3>
<div class="outline-text-3" id="text-method-update-dao">
<p>
→ dao
</p>

<p>
Update the representation of the given dao in the database to the values in the
object. This is not defined for tables that do not have any non-primary-key
columns. Raises an error when no row matching the dao exists.
</p>
</div>
</div>

<div id="outline-container-function-save-dao" class="outline-3">
<h3 id="function-save-dao">function save-dao (dao)</h3>
<div class="outline-text-3" id="text-function-save-dao">
<p>
→ boolean
</p>

<p>
Tries to insert the given dao using insert-dao. If the dao has unbound slots,
those slots will be updated and bound by default data triggered by the
database. If this raises a unique key violation error, it tries to update it by
using update-dao instead. In this case, if the dao has unbound slots, updating
will fail with an unbound slots error.
</p>

<p>
Be aware that there is a possible race condition here ― if some other process
deletes the row at just the right moment, the update fails as well. Returns a
boolean telling you whether a new row was inserted.
</p>

<p>
This function is unsafe to use inside of a transaction ― when a row with the
given keys already exists, the transaction will be aborted. Use
save-dao/transaction instead in such a situation.
</p>

<p>
See also: upsert-dao.
</p>
</div>
</div>

<div id="outline-container-function-save-dao-transaction" class="outline-3">
<h3 id="function-save-dao-transaction">function save-dao/transaction (dao)</h3>
<div class="outline-text-3" id="text-function-save-dao-transaction">
<p>
→ boolean
</p>

<p>
The transaction safe version of save-dao. Tries to insert the given dao using
insert-dao. If this raises a unique key violation error, it tries to update it
by using update-dao instead. If the dao has unbound slots, updating will fail
with an unbound slots error. If the dao has unbound slots, those slots will be
updated and bound by default data triggered by the database.
</p>

<p>
Be aware that there is a possible race condition here ― if some other process
deletes the row at just the right moment, the update fails as well. Returns a
boolean telling you whether a new row was inserted.
</p>

<p>
Acts exactly like save-dao, except that it protects its attempt to insert the
object with a rollback point, so that a failure will not abort the transaction.
</p>

<p>
See also: upsert-dao.
</p>
</div>
</div>

<div id="outline-container-method-upsert-dao" class="outline-3">
<h3 id="method-upsert-dao">method upsert-dao (dao)</h3>
<div class="outline-text-3" id="text-method-upsert-dao">
<p>
→ dao
</p>

<p>
Like save-dao or save-dao/transaction but using a different method that doesn't
involve a database exception. This is safe to use both in and outside a
transaction, though it's advisable to always do it in a transaction to prevent
a race condition. The way it works is:
</p>

<p>
If the object contains unbound slots, we call insert-dao directly, thus the
behavior is like save-dao.
</p>

<p>
Otherwise we try to update a record with the same primary key. If the PostgreSQL
returns a non-zero number of rows updated it treated as the record is already
exists in the database, and we stop here.
</p>

<p>
If the PostgreSQL returns a zero number of rows updated, it treated as the
record does not exist and we call insert-dao.
</p>

<p>
The race condition might occur at step 3 if there's no transaction: if UPDATE
returns zero number of rows updated and another thread inserts the record at
that moment, the insertion implied by step 3 will fail.
</p>

<p>
Note, that triggers and rules may affect the number of inserted or updated rows
returned by PostgreSQL, so zero or non-zero number of affected rows may not
actually indicate the existence of record in the database.
</p>

<p>
This method returns two values: the DAO object and a boolean (T if the object
was inserted, NIL if it was updated).
</p>

<p>
IMPORTANT: This is not the same as insert on conflict (sometimes called an upsert)
in Postgresq. An upsert in Postgresql terms is an insert with a fallback of updating
the row if the insert key conflicts with an already existing row. An upsert-dao
in Postmodern terms is the reverse. First you try updating an existing object. If
there is no existing object to oupdate, then you insert a new object.
</p>
</div>
</div>

<div id="outline-container-method-delete-dao" class="outline-3">
<h3 id="method-delete-dao">method delete-dao (dao)</h3>
<div class="outline-text-3" id="text-method-delete-dao">
<p>
Delete the given dao from the database.
</p>
</div>
</div>

<div id="outline-container-function-dao-table-name" class="outline-3">
<h3 id="function-dao-table-name">function dao-table-name (class)</h3>
<div class="outline-text-3" id="text-function-dao-table-name">
<p>
→ string
</p>

<p>
Get the name of the table associated with the given DAO class (or symbol naming
such a class).
</p>
</div>
</div>

<div id="outline-container-function-dao-table-definition" class="outline-3">
<h3 id="function-dao-table-definition">function dao-table-definition (class)</h3>
<div class="outline-text-3" id="text-function-dao-table-definition">
<p>
→ string
</p>

<p>
Given a DAO class, or the name of one, this will produce an SQL query string
with a definition of the table. This is just the bare simple definition, so if
you need any extra indices or or constraints, you'll have to write your own
queries to add them, in which case look to s-sql's create-table function.
</p>
</div>
</div>
