doc/dao-classes.org
** macro with-column-writers ((&rest writers) &body body)
   :PROPERTIES:
   :CUSTOM_ID: macro-with-column-writers
   :END:

Provides control over the way get-dao, select-dao, and query-dao read values
from the database. This is not commonly needed, but can be used to reduce the
amount of queries a system makes. writers should be a list of alternating column
names (strings or symbols) and writers, where writers are either symbols
referring to a slot in the objects, or functions taking two arguments ― an
instance and a value ― which can be used to somehow store the value in the new
instance. When any DAO-fetching function is called in the body, and columns
matching the given names are encountered in the result, the writers are used
instead of the default behaviour (try and store the value in the slot that
matches the column name).

An example of using this is to add some non-column slots to a DAO class, and use
query-dao within a with-column-writers form to pull in extra information about
the objects, and immediately store it in the new instances.

Another example would be to convert something that is in one format in Postgresql
e.g. a string to something else in your dao. Suppose your dao has slots that contain
a regular list, an alist and a plist but for whatever reason the data is stored in
Postgresql as text:
#+begin_src lisp
(defclass listy ()
  ((id :col-type integer :col-identity t :accessor id)
   (name :col-type text :col-unique t :col-check (:<> 'name "")
         :initarg :name :accessor name)
   (rlist :col-type text :initarg :rlist :accessor rlist)
   (alist :col-type text :initarg :alist :accessor alist)
   (plist :col-type text :initarg :plist :accessor plist))
  (:metaclass dao-class)
  (:table-name listy))
#+end_src

* Table definition and creation using a dao
  :PROPERTIES:
  :CUSTOM_ID: table-definition
  :END:
It can be useful to have the SQL statements needed to build an application's
tables available from the source code, to do things like automatically deploying
a database. The following macro and functions allow you to group sets of SQL
statements under symbols, with some shortcuts for common elements
in table definitions.

** macro deftable (name &body definition)
   :PROPERTIES:
   :CUSTOM_ID: macro-deftable
   :END:

Define a table. name can be either a symbol or a (symbol string) list. In the
first case, the table name is derived from the symbol's name by S-SQL's rules.
In the second case, the name is given explicitly. The body of definitions can
contain anything that evaluates to a string, as well as S-SQL expressions. The
variables =*table-name*= and =*table-symbol*= are bound to the relevant values in
the body. Note that the evaluation of the definition is ordered, so you'll
generally want to create your table first and then define indices on it.

** variable =*table-name*=
   :PROPERTIES:
   :CUSTOM_ID: variable-table-name
   :END:

Used inside deftable to find the name of the table being defined.

** variable =*table-symbol*=
   :PROPERTIES:
   :CUSTOM_ID: variable-table-symbol
   :END:

Used inside deftable to find the symbol naming the table being defined.

** function !dao-def ()
   :PROPERTIES:
   :CUSTOM_ID: function-_dao-def
   :END:

Should only be used inside a deftable form. Define this table using the
corresponding DAO class' slots. Adds the result of calling dao-table-definition
on *table-symbol* to the definition.

** function !index (&rest columns), !unique-index (&rest columns)
   :PROPERTIES:
   :CUSTOM_ID: function-_index
   :END:

Used inside a deftable form. Define an index on the table being defined. The
columns can be given as symbols or strings.

** function !foreign (target fields &rest target-fields/on-delete/on-update/deferrable/initially-deferred)
   :PROPERTIES:
   :CUSTOM_ID: function-_foreign
   :END:

Used inside a deftable form. Add a foreign key to the table being defined.
target-table is the referenced table. columns is a list of column names or
single name in this table, and, if the columns have different names in the
referenced table, target-columns must be another list of column names or single
column name of the target-table, or :primary-key to denote the column(s) of the
target-table's primary key as referenced column(s).

The on-delete and on-update arguments can be used to specify ON DELETE and ON
UPDATE actions, as per the keywords allowed in create-table. In addition, the
deferrable and initially-deferred arguments can be used to indicate whether
constraint checking can be deferred until the current transaction completed, and
whether this should be done by default. Note that none of these are
really &key arguments, but rather are picked out of a &rest arg at runtime, so
that they can be specified even when target-columns is not given.

** function !unique (target-fields &key deferrable initially-deferred)
   :PROPERTIES:
   :CUSTOM_ID: function-_unique
   :END:

Constrains one or more columns to only contain unique (combinations of) values,
with deferrable and initially-deferred defined as in !foreign

** function create-table (symbol)
   :PROPERTIES:
   :CUSTOM_ID: function-create-table
   :END:

Takes the name of a dao-class and creates the table identified by symbol by
executing all forms in its definition as found in the =*tables*= list.

** function create-all-tables ()
   :PROPERTIES:
   :CUSTOM_ID: function-create-all-tables
   :END:

Creates all defined tables.

** function create-package-tables (package)
   :PROPERTIES:
   :CUSTOM_ID: function-create-package-tables
   :END:

Creates all tables identified by symbols interned in the given package.

** variables =*table-name*=, =*table-symbol*=
   :PROPERTIES:
   :CUSTOM_ID: variable-table-name
   :END:

Used inside deftable to find the name of the table being defined.

Used inside deftable to find the symbol naming the table being defined.

** function drop-table (table-name &key if-exists cascade)
   :PROPERTIES:
   :CUSTOM_ID: function-drop-table
   :END:

If a table exists, drop a table. Available additional key parameters
are :if-exists and :cascade.

