doc/dao-classes.html

<div id="outline-container-macro-with-column-writers" class="outline-3">
<h3 id="macro-with-column-writers">macro with-column-writers ((&amp;rest writers) &amp;body body)</h3>
<div class="outline-text-3" id="text-macro-with-column-writers">
<p>
Provides control over the way get-dao, select-dao, and query-dao read values
from the database. This is not commonly needed, but can be used to reduce the
amount of queries a system makes. writers should be a list of alternating column
names (strings or symbols) and writers, where writers are either symbols
referring to a slot in the objects, or functions taking two arguments ― an
instance and a value ― which can be used to somehow store the value in the new
instance. When any DAO-fetching function is called in the body, and columns
matching the given names are encountered in the result, the writers are used
instead of the default behaviour (try and store the value in the slot that
matches the column name).
</p>

<p>
An example of using this is to add some non-column slots to a DAO class, and use
query-dao within a with-column-writers form to pull in extra information about
the objects, and immediately store it in the new instances.
</p>

<p>
Another example would be to convert something that is in one format in Postgresql
e.g. a string to something else in your dao. Suppose your dao has slots that contain
a regular list, an alist and a plist but for whatever reason the data is stored in
Postgresql as text:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">listy</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-identity</span> t <span style="color: #23d7d7;">:accessor</span> id)
   (name <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:col-unique</span> t <span style="color: #23d7d7;">:col-check</span> (<span style="color: #23d7d7;">:&lt;&gt;</span> 'name <span style="color: #e67128;">""</span>)
         <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span> <span style="color: #23d7d7;">:accessor</span> name)
   (rlist <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:rlist</span> <span style="color: #23d7d7;">:accessor</span> rlist)
   (alist <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:alist</span> <span style="color: #23d7d7;">:accessor</span> alist)
   (plist <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:plist</span> <span style="color: #23d7d7;">:accessor</span> plist))
  (<span style="color: #23d7d7;">:metaclass</span> dao-class)
  (<span style="color: #23d7d7;">:table-name</span> listy))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-table-definition" class="outline-2">
<h2 id="table-definition">Table definition and creation using a dao</h2>
<div class="outline-text-2" id="text-table-definition">
<p>
It can be useful to have the SQL statements needed to build an application's
tables available from the source code, to do things like automatically deploying
a database. The following macro and functions allow you to group sets of SQL
statements under symbols, with some shortcuts for common elements
in table definitions.
</p>
</div>

<div id="outline-container-macro-deftable" class="outline-3">
<h3 id="macro-deftable">macro deftable (name &amp;body definition)</h3>
<div class="outline-text-3" id="text-macro-deftable">
<p>
Define a table. name can be either a symbol or a (symbol string) list. In the
first case, the table name is derived from the symbol's name by S-SQL's rules.
In the second case, the name is given explicitly. The body of definitions can
contain anything that evaluates to a string, as well as S-SQL expressions. The
variables <code>*table-name*</code> and <code>*table-symbol*</code> are bound to the relevant values in
the body. Note that the evaluation of the definition is ordered, so you'll
generally want to create your table first and then define indices on it.
</p>
</div>
</div>

<div id="outline-container-variable-table-name" class="outline-3">
<h3 id="variable-table-name">variable <code>*table-name*</code></h3>
<div class="outline-text-3" id="text-variable-table-name">
<p>
Used inside deftable to find the name of the table being defined.
</p>
</div>
</div>

<div id="outline-container-variable-table-symbol" class="outline-3">
<h3 id="variable-table-symbol">variable <code>*table-symbol*</code></h3>
<div class="outline-text-3" id="text-variable-table-symbol">
<p>
Used inside deftable to find the symbol naming the table being defined.
</p>
</div>
</div>

<div id="outline-container-function-_dao-def" class="outline-3">
<h3 id="function-_dao-def">function !dao-def ()</h3>
<div class="outline-text-3" id="text-function-_dao-def">
<p>
Should only be used inside a deftable form. Define this table using the
corresponding DAO class' slots. Adds the result of calling dao-table-definition
on <b>table-symbol</b> to the definition.
</p>
</div>
</div>

<div id="outline-container-function-_index" class="outline-3">
<h3 id="function-_index">function !index (&amp;rest columns), !unique-index (&amp;rest columns)</h3>
<div class="outline-text-3" id="text-function-_index">
<p>
Used inside a deftable form. Define an index on the table being defined. The
columns can be given as symbols or strings.
</p>
</div>
</div>

<div id="outline-container-function-_foreign" class="outline-3">
<h3 id="function-_foreign">function !foreign (target fields &amp;rest target-fields/on-delete/on-update/deferrable/initially-deferred)</h3>
<div class="outline-text-3" id="text-function-_foreign">
<p>
Used inside a deftable form. Add a foreign key to the table being defined.
target-table is the referenced table. columns is a list of column names or
single name in this table, and, if the columns have different names in the
referenced table, target-columns must be another list of column names or single
column name of the target-table, or :primary-key to denote the column(s) of the
target-table's primary key as referenced column(s).
</p>

<p>
The on-delete and on-update arguments can be used to specify ON DELETE and ON
UPDATE actions, as per the keywords allowed in create-table. In addition, the
deferrable and initially-deferred arguments can be used to indicate whether
constraint checking can be deferred until the current transaction completed, and
whether this should be done by default. Note that none of these are
really &amp;key arguments, but rather are picked out of a &amp;rest arg at runtime, so
that they can be specified even when target-columns is not given.
</p>
</div>
</div>

<div id="outline-container-function-_unique" class="outline-3">
<h3 id="function-_unique">function !unique (target-fields &amp;key deferrable initially-deferred)</h3>
<div class="outline-text-3" id="text-function-_unique">
<p>
Constrains one or more columns to only contain unique (combinations of) values,
with deferrable and initially-deferred defined as in !foreign
</p>
</div>
</div>

<div id="outline-container-function-create-table" class="outline-3">
<h3 id="function-create-table">function create-table (symbol)</h3>
<div class="outline-text-3" id="text-function-create-table">
<p>
Takes the name of a dao-class and creates the table identified by symbol by
executing all forms in its definition as found in the <code>*tables*</code> list.
</p>
</div>
</div>

<div id="outline-container-function-create-all-tables" class="outline-3">
<h3 id="function-create-all-tables">function create-all-tables ()</h3>
<div class="outline-text-3" id="text-function-create-all-tables">
<p>
Creates all defined tables.
</p>
</div>
</div>

<div id="outline-container-function-create-package-tables" class="outline-3">
<h3 id="function-create-package-tables">function create-package-tables (package)</h3>
<div class="outline-text-3" id="text-function-create-package-tables">
<p>
Creates all tables identified by symbols interned in the given package.
</p>
</div>
</div>

<div id="outline-container-variable-table-name" class="outline-3">
<h3 id="variable-table-name">variables <code>*table-name*</code>, <code>*table-symbol*</code></h3>
<div class="outline-text-3" id="text-variable-table-name">
<p>
Used inside deftable to find the name of the table being defined.
</p>

<p>
Used inside deftable to find the symbol naming the table being defined.
</p>
</div>
</div>

<div id="outline-container-function-drop-table" class="outline-3">
<h3 id="function-drop-table">function drop-table (table-name &amp;key if-exists cascade)</h3>
<div class="outline-text-3" id="text-function-drop-table">
<p>
If a table exists, drop a table. Available additional key parameters
are :if-exists and :cascade.
</p>
</div>
</div>
</div>
