doc/dao-classes.org
* Out of Sync Dao Objects
:PROPERTIES:
:CUSTOM_ID: out-of-sync-dao-objects
:END:
What Happens when dao classes are out of sync with the database table?
Let's establish our baseline
#+BEGIN_SRC lisp
  (defclass test-data ()
    ((id :col-type serial :initarg :id :accessor test-id)
     (a :col-type (or (varchar 100) db-null) :initarg :a :accessor test-a)
     (b :col-type boolean :col-default nil :initarg :b :accessor test-b)
     (c :col-type integer :col-default 0 :initarg :c :accessor test-c)
     (d :col-type numeric :col-default 0.0 :initarg :d :accessor test-d))
    (:metaclass dao-class)
    (:table-name dao-test)
    (:keys id))

  #<DAO-CLASS S-SQL-TESTS::TEST-DATA>

  (execute (dao-table-definition 'test-data))
#+END_SRC

Now we define a class that uses the same table, but does not have all the columns.
#+BEGIN_SRC lisp
  (defclass test-data-short ()
    ((id :col-type serial :initarg :id :accessor test-id)
     (a :col-type (or (varchar 100) db-null) :initarg :a :accessor test-a))
    (:metaclass dao-class)
    (:table-name dao-test)
    (:keys id))
#+END_SRC

We create an instance of the shortened class and try to save it, then
check the results.
#+BEGIN_SRC lisp
  (let ((dao (make-instance 'test-data-short :a "first short")))
    (save-dao dao))

  (query (:select '* :from 'dao-test) :alists)
  (((:ID . 1) (:A . "first short") (:B) (:C . 0) (:D . 0)))
#+END_SRC

It was a successful save, and we see that the missing columns took their
default values.

Now we define a shortened class, but the a slot is now numeric or null
instead of a string and try to save it and check it.
#+BEGIN_SRC lisp
  (defclass test-data-short-wrong-1 ()
    ((id :col-type serial :initarg :id :accessor test-id)
     (a :col-type (or numeric db-null) :initarg :a :accessor test-a))
    (:metaclass dao-class)
    (:table-name dao-test)
    (:keys id))

  (let ((dao (make-instance 'test-data-short-wrong-1 :a 12.75)))
    (save-dao dao))

  (query (:select '* :from 'dao-test) :alists)

  (((:ID . 1) (:A . "first short") (:B) (:C . 0) (:D . 0))
   ((:ID . 2) (:A . "12.75") (:B) (:C . 0) (:D . 0))
#+END_SRC

Notice that the 12.75 has been converted into a string when it was saved.
Postgresql did this automatically. Anything going into a text or varchar
column will be converted to a string.

Now we will go the other way and define a dao with the right number
of columns, but col d is a string when the database expects a numeric
and check that.
#+BEGIN_SRC lisp
  (defclass test-data-d-string ()
    ((id :col-type serial :initarg :id :accessor test-id)
     (a :col-type (or (varchar 100) db-null) :initarg :a :accessor test-a)
     (b :col-type boolean :col-default nil :initarg :b :accessor test-b)
     (c :col-type integer :col-default 0 :initarg :c :accessor test-c)
     (d :col-type text :col-default "" :initarg :d :accessor test-d))
    (:metaclass dao-class)
    (:table-name dao-test)
    (:keys id))

  (let ((dao (make-instance 'test-data-d-string :a "D string" :b nil :c 14
                                                :d "Trying string")))
    (save-dao dao))

  Database error 22P02: invalid input syntax for type numeric: "Trying string"
  QUERY: INSERT INTO dao_test (d, c, b, a) VALUES (E'Trying string', 14, false, E'D string') RETURNING id
  [Condition of type DATA-EXCEPTION]

#+END_SRC
Ok. That threw a data exception. What happens if we try to force a numeric into
an integer column?
#+BEGIN_SRC lisp
  (let ((dao (make-instance 'test-data-d-string :a "D string" :b nil :c 14.37
                                                :d 18.78)))
    (save-dao dao))

  Database error 22P02: invalid input syntax for type integer: "14.37"
  [Condition of type CL-POSTGRES-ERROR:DATA-EXCEPTION]

#+END_SRC
Ok. Postgresql is enforcing the types.
#+BEGIN_SRC lisp
  (let ((dao (make-instance 'test-data-d-string :a "D string" :b nil :c 14
                                                :d 18.78)))
    (save-dao dao))

  (query (:select '* :from 'dao-test) :alists)
  (((:ID . 1) (:A . "first short") (:B) (:C . 0) (:D . 0))
   ((:ID . 2) (:A . "12.75") (:B) (:C . 0) (:D . 0))
   ((:ID . 3) (:A . "D string") (:B) (:C . 14) (:D . 939/50)))
#+END_SRC

Notice that postmodern returned a ratio 939/50 for the numeric 18.78.

We have looked at saving daos. Now look at returning a dao from the database
where the dao definition is different than the table definition.
First checking to see if we can get a correct dao back.
#+BEGIN_SRC lisp
  (get-dao 'test-data 3)
  #<TEST-DATA {100C82AA33}>
#+END_SRC
Ok. That worked as expected.

Second using a shortened dao that is correct in type of columns, but
incorrect n the number of columns compared to the database table.
#+BEGIN_SRC lisp
  (get-dao 'test-data-short 3)
  No slot named b in class TEST-DATA-SHORT. DAO out of sync with table, or
  incorrect query used.
  [Condition of type SIMPLE-ERROR]

  Restarts:
  0: [RETRY] Retry SLIME REPL evaluation request.
  1: [*ABORT] Return to SLIME's top level.
  2: [ABORT] abort thread (#<THREAD "new-repl-thread" RUNNING {100C205083}>)

#+END_SRC
Not only did it throw an exception, but I needed to actually use an interrupt
from the repl to get back in operation. And then use (reconnect =*database*=).
Very Bad result.

THIS ERROR IS CONTROLLABLE BY THE VARIABLE =*IGNORE-UNKNOWN-COLUMNS*=

Now if we setf the default global variable =*ignore-unknown-columns*= to t
#+BEGIN_SRC lisp
  (setf *ignore-unknown-columns* t)

  (get-dao 'test-data-short 3)
  #<TEST-DATA-SHORT {10054DFED3}>

  (describe (get-dao 'test-data-short 3))
  #<TEST-DATA-SHORT {100B249783}>
  [standard-object]

  Slots with :INSTANCE allocation:
  ID                             = 3
  A                              = "D string"
#+END_SRC
We now have a dao that is a subset of the database table it pulled from.
Just to validate that:
#+BEGIN_SRC lisp
  (query (:select '* :from 'dao-test :where (:= 'id 3)))

  ((3 "D string" NIL 14 939/50))
#+END_SRC
Just to be thorough, let's use a dao that has more slots than the database table.
#+BEGIN_SRC lisp
  (defclass test-data-long ()
    ((id :col-type serial :initarg :id :accessor test-id)
     (a :col-type (or (varchar 100) db-null) :initarg :a :accessor test-a)
     (b :col-type boolean :col-default nil :initarg :b :accessor test-b)
     (c :col-type integer :col-default 0 :initarg :c :accessor test-c)
     (d :col-type numeric :col-default 0.0 :initarg :d :accessor test-d)
     (e :col-type text :col-default "sell by date" :initarg :e :accessor test-e))
    (:metaclass dao-class)
    (:table-name dao-test)
    (:keys id))
#+END_SRC
Now if we make an instance of this dao and try to save it in the dao-class table:
#+BEGIN_SRC lisp
  (let ((dao (make-instance 'test-data-long :a "first short" :d 37.3)))
    (save-dao dao))

  Database error 42703: column "e" does not exist
  QUERY: INSERT INTO dao_test (d, a)  VALUES ($1, $2) RETURNING e, c, b, id
  [Condition of type CL-POSTGRES-ERROR:UNDEFINED-COLUMN]
#+END_SRC
Postgresql rejected the attempted insert with an undefined column error.
