doc/dao-classes.html
<div id="outline-container-multi-table-dao-class-object-less-simple-version" class="outline-4">
<h4 id="multi-table-dao-class-object-less-simple-version">Less Simple Version</h4>
<div class="outline-text-4" id="text-multi-table-dao-class-object-less-simple-version">
<p>
In the -n version, we are going to use the id columns as the primary key.
We will not need to tell deftable t
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">region-n</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-identity</span> t <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:id</span> <span style="color: #23d7d7;">:reader</span> region-id)
   (name <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span> <span style="color: #23d7d7;">:accessor</span> region-name))
  (<span style="color: #23d7d7;">:metaclass</span> pomo:dao-class))

(deftable region-n
  (!dao-def)
  (!unique 'name))

(create-table 'region-n)

(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">country-n</span> ()
  ((id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:col-identity</span> t <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:id</span> <span style="color: #23d7d7;">:reader</span> country-id)
   (name <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span>
         <span style="color: #23d7d7;">:reader</span> country-name)
   (region-id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:region-id</span> <span style="color: #23d7d7;">:accessor</span> region-id))
   (<span style="color: #23d7d7;">:metaclass</span> dao-class))

(deftable country-n
  (!dao-def)
  (!unique 'name)
  (!foreign 'region-n 'region-id 'id))

(create-table 'country-n)
</pre>
</div>
<p>
How do you find the region-id? While we set the primary key as name for both
country and region in the simple version, it will be a little more work in the
less simple version. Lets start by inserting a couple of regions and we will
stick with the dao method for the moment:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(insert-dao (make-instance 'region-d <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Western Europe"</span>))
(insert-dao (make-instance 'region-n <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Western Europe"</span>))
(insert-dao (make-instance 'region-d <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Southern Europe"</span>))
(insert-dao (make-instance 'region-n <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Southern Europe"</span>))
</pre>
</div>

<p>
Now we can add a few countries to country-d:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(insert-dao (make-instance 'country-d <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"The Netherlands"</span>
                                      <span style="color: #23d7d7;">:region-name</span> <span style="color: #e67128;">"Western Europe"</span>))

(insert-dao (make-instance 'country-d <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Croatia"</span>
                                      <span style="color: #23d7d7;">:region-name</span> <span style="color: #e67128;">"Southern Europe"</span>))
</pre>
</div>
<p>
Now we can add a few countries to country-n, remembering that for this version,
name is not the primary key so how to get the region dao with the name "Western Europe"? For region-d
it is easy because the name is the primary key. So
</p>
<div class="org-src-container">
<pre class="src src-lisp">(get-dao 'region-d <span style="color: #e67128;">"Western Europe"</span>)
#&lt;REGION-D {100A322D43}&gt;
</pre>
</div>
<p>
For region-n it is a little more complicated because the primary key is the id
column, not the name column. So there are a couple of ways to do it. First is
select-dao which will return a list of daos meeting a test criteria, in a sorted
order if that third parameter is also provided. Eg.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(select-dao 'region-n (<span style="color: #23d7d7;">:=</span> 'id 1))
(#&lt;REGION-N {100AAC6E13}&gt;)

(select-dao 'region-n (<span style="color: #23d7d7;">:=</span> 'name <span style="color: #e67128;">"Western Europe"</span>))
(#&lt;REGION-N {100A813CF3}&gt;)

(select-dao 'region-n t 'name)
(#&lt;REGION-N {100AC90FA3}&gt; #&lt;REGION-N {100AC911B3}&gt;)
</pre>
</div>

<p>
Another method with is query-dao, which takes a row and inserts it into a dao.
That gets us a list of daos meeting the select criteria.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query-dao 'region-n <span style="color: #e67128;">"select * from region_n where name = 'Western Europe'"</span>)
(#&lt;REGION {1009E75E63}&gt;)
</pre>
</div>
<p>
or, using s-sql expression
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query-dao 'region-n (<span style="color: #23d7d7;">:select</span> '*
                      <span style="color: #23d7d7;">:from</span> 'region-n
                      <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'name <span style="color: #e67128;">"Western Europe"</span>)))
(#&lt;REGION-D {100A50DA13}&gt;)
</pre>
</div>

<p>
Here are two different ways of generating the region-id so we can insert a new dao
into country-n:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(insert-dao
  (make-instance 'country-n
                 <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"The Netherlands"</span>
                 <span style="color: #23d7d7;">:region-id</span> (region-id
                              (first (select-dao 'region-n
                                                 (<span style="color: #23d7d7;">:=</span> 'name <span style="color: #e67128;">"Western Europe"</span>))))))
#&lt;COUNTRY-N {1002AD79B3}&gt;

(insert-dao
  (make-instance 'country-n
                 <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Croatia"</span>
                 <span style="color: #23d7d7;">:region-id</span> (query (<span style="color: #23d7d7;">:select</span> 'id
                                    <span style="color: #23d7d7;">:from</span> 'region-n
                                    <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'name <span style="color: #e67128;">"Southern Europe"</span>))
                             <span style="color: #23d7d7;">:single</span>)))
#&lt;COUNTRY-N {1002ADE2B3}&gt;
</pre>
</div>
<p>
But the returned row need not be the result from a single table. Suppose we
create a third table that has population by year and inserted a couple of rows.
This time we will do it with s-sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:create-table</span> 'country-population ((id <span style="color: #23d7d7;">:type</span> bigserial)
                                          (country-id <span style="color: #23d7d7;">:type</span> integer)
                                          (year <span style="color: #23d7d7;">:type</span> integer)
                                          (population <span style="color: #23d7d7;">:type</span> integer))))

(<span style="color: #ffad29; font-weight: bold;">let</span> ((country-id (query (<span style="color: #23d7d7;">:select</span> 'id
                          <span style="color: #23d7d7;">:from</span> 'country-d
                          <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'name <span style="color: #e67128;">"The Netherlands"</span>))
                         <span style="color: #23d7d7;">:single</span>)))
  (query (<span style="color: #23d7d7;">:insert-rows-into</span> 'country-population
          <span style="color: #23d7d7;">:columns</span> 'country-id 'year 'population
          <span style="color: #23d7d7;">:values</span> `((,country-id 2014 16830000)
                    (,country-id 2015 16900000)
                    (,country-id 2016 16980000)
                    (,country-id 2017 17080000)))))

(<span style="color: #ffad29; font-weight: bold;">let</span> ((country-id (query (<span style="color: #23d7d7;">:select</span> 'id
                          <span style="color: #23d7d7;">:from</span> 'country-d
                          <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'name <span style="color: #e67128;">"Croatia"</span>))
                         <span style="color: #23d7d7;">:single</span>)))
  (query (<span style="color: #23d7d7;">:insert-rows-into</span> 'country-population
          <span style="color: #23d7d7;">:columns</span> 'country-id 'year 'population
          <span style="color: #23d7d7;">:values</span> `((,country-id 2014 4255518)
                    (,country-id 2015 4232873)
                    (,country-id 2016 4208611)
                    (,country-id 2017 4182846)))))
</pre>
</div>
<p>
Now we create a class that pulls from all three tables (country, region and
country-population).
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">country-with-population</span> ()
  ((country-name <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:country-name</span>
           <span style="color: #23d7d7;">:reader</span> country-name)
     (region-name <span style="color: #23d7d7;">:col-type</span> string <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:region-name</span> <span style="color: #23d7d7;">:accessor</span> region-name)
     (year <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:year</span> <span style="color: #23d7d7;">:reader</span> year)
     (population <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:population</span> <span style="color: #23d7d7;">:reader</span> population))
     (<span style="color: #23d7d7;">:metaclass</span> dao-class)
     (<span style="color: #23d7d7;">:keys</span> country-name))
</pre>
</div>
<p>
Can we use query-dao to get a list of country-with-population daos with the most
recent population data? The answer is yes. That would give us a class that maybe
our application can use without having to worry about constantly going back to
the database to look for the region's name or whatever.
</p>

<p>
Of course you still need to get the data into the class instances. You could
write the following one time as a function to generate your list of countries
with the most recent population data. Note that you need to rename the columns
to the appropriate initarg name (e.g. 'country-n.name is selected as
'country-name). You do not need to worry about the order of the selected rows.
So long as the selections are renamed properly, the slots will be populated
properly.
</p>

<p>
In the data that we have in the system, we happen to know that the years
available are the same for every country. In that case, we just want the
information for the maximum year. One way to do that would be:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query-dao 'country-with-population
                 (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:as</span> 'country-n.name 'country-name)
                          'year
                          (<span style="color: #23d7d7;">:as</span> 'region-n.name 'region-name)
                          'population
                      <span style="color: #23d7d7;">:from</span> 'country-n
                      <span style="color: #23d7d7;">:inner-join</span> 'region-n
                      <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'country-n.region-id 'region-n.id)
                      <span style="color: #23d7d7;">:inner-join</span> 'country-population
                      <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'country-n.id 'country-population.country-id)
                      <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'year (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:max</span> 'year)
                                        <span style="color: #23d7d7;">:from</span> 'country-population))))
</pre>
</div>
<p>
But what happens if the data is not the same for both countries? Lets drop the
2017 population data row for Croatia and make sure it still returns the most
current year that we have for both countries.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:delete-from</span> 'country-population
        <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:and</span> (<span style="color: #23d7d7;">:=</span> 'country-id 2)
                     (<span style="color: #23d7d7;">:=</span> 'year 2017))))
</pre>
</div>
<p>
If we run the same query from above, we only get an instance for The Netherlands
because that was the only data available for the maximum year (2017). We need to
approach the data slightly differently.Because this is postmodern and we only
care about the Postgresql database, we can use its DISTINCT ON extension to the
SQL standard.
</p>

<p>
See <a href="https://www.postgresql.org/docs/current/sql-select.html#SQL-DISTINCT">https://www.postgresql.org/docs/current/sql-select.html#SQL-DISTINCT</a>
for more documentation.
</p>

<p>
The following query will pull the most recent year for both countries. How did
that happen? We limited the select clause to distinct country names so we would
only pull one of each country, then ordered the result by country-name, but most
importantly by year descending.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query-dao 'country-with-population
                 (<span style="color: #23d7d7;">:order-by</span> (<span style="color: #23d7d7;">:select</span>  (<span style="color: #23d7d7;">:as</span> 'country-n.name 'country-name)
                                      'year
                                      (<span style="color: #23d7d7;">:as</span> 'region-n.name 'region-name)
                                      'population
                             <span style="color: #23d7d7;">:distinct-on</span> 'country-n.name
                             <span style="color: #23d7d7;">:from</span> 'country-n
                             <span style="color: #23d7d7;">:inner-join</span> 'region-n
                             <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'country-n.region-id 'region-n.id)
                             <span style="color: #23d7d7;">:inner-join</span> 'country-population
                             <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'country-n.id
                                     'country-population.country-id))
                     'country-name
                     (<span style="color: #23d7d7;">:desc</span> 'year)))
(#&lt;COUNTRY-WITH-POPULATION {1009AFAEC3}&gt;
 #&lt;COUNTRY-WITH-POPULATION {1009AFC963}&gt;)
</pre>
</div>
<p>
At this point you could write a function that gets a country-with-population dao
pulling the most recent population year from the database:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">get-country-with-most-recent-population</span> (country)
  (car (query-dao 'country-with-population
                  (<span style="color: #23d7d7;">:order-by</span> (<span style="color: #23d7d7;">:select</span>  (<span style="color: #23d7d7;">:as</span> 'country-n.name 'country-name)
                                       'year
                                       (<span style="color: #23d7d7;">:as</span> 'region-n.name 'region-name)
                                       'population
                                       <span style="color: #23d7d7;">:distinct-on</span> 'country-n.name
                                       <span style="color: #23d7d7;">:from</span> 'country-n
                                       <span style="color: #23d7d7;">:inner-join</span> 'region-n
                                       <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'country-n.region-id
                                               'region-n.id)
                                       <span style="color: #23d7d7;">:inner-join</span> 'country-population
                                       <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'country-n.id
                                               'country-population.country-id)
                                       <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'country-n.name '$1))
                             'country-name
                             (<span style="color: #23d7d7;">:desc</span> 'year))
                  country)))
</pre>
</div>
<p>
Obviously it is not get-dao, which is simpler but just pulls everything in a
single row from a table and this pulls just the data you want from three
different tables and it is bespoken for that class. Because get-dao is a generic
function, with the normal method being applied when passing a symbol, you could
write a new method for get-dao that would apply if you passed it an actual
country-with-population class instance.
</p>

<p>
If you want to display fields in a record which matches a dao class that you
have set up, you can call get-dao with the name of table and the primary key.
In this example, the table is "countries and the primary key happens to be the
field "id" with a value of 1.
</p>

<p>
For example, assume we pull a dao object out of our country-n table for
Croatia:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(describe (get-dao 'country-n 2))
#&lt;COUNTRY-N {1005BF7273}&gt;
  [standard-object]

Slots with <span style="color: #23d7d7;">:INSTANCE</span> allocation:
  ID                             = 2
  NAME                           = <span style="color: #e67128;">"Croatia"</span>
  REGION-ID                      = 2
</pre>
</div>
<p>
Notice that the region-id field has an integer value. This works. But assume it
has a slot of region-id, which refers to an id in the table "regions" and you
want the name of the region displayed rather than the region-id. There is a hack
using with-column-writers which essentially writes the name into the link slot.
Now, we write a function that uses the with-column-writers macro and pull in the
actual region name from the regions table.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">get-country2</span> (country-name )
  (first (<span style="color: #ffad29; font-weight: bold;">with-column-writers</span>
         ('region-n 'region-id)
         (query-dao 'country-n
                    (<span style="color: #23d7d7;">:select</span> 'country-n.* (<span style="color: #23d7d7;">:as</span> 'region-n.name 'region-n)
                             <span style="color: #23d7d7;">:from</span> 'country-n
                             <span style="color: #23d7d7;">:left-join</span> 'region-n
                             <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'country-n.region-id 'region-n.id)
                             <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'country-n.name country-name))))))

(describe (get-country2 <span style="color: #e67128;">"Croatia"</span>))
#&lt;COUNTRIES {1003AD23D1}&gt;
  [standard-object]
(describe (get-country2 <span style="color: #e67128;">"Croatia"</span>))
#&lt;COUNTRY-N {100593DF03}&gt;
  [standard-object]

Slots with <span style="color: #23d7d7;">:INSTANCE</span> allocation:
  ID                             = 2
  NAME                           = <span style="color: #e67128;">"Croatia"</span>
  REGION-ID                      = <span style="color: #e67128;">"Southern Europe"</span>


(region-id (get-country2 <span style="color: #e67128;">"Croatia"</span>))
<span style="color: #e67128;">"Southern Europe"</span>
</pre>
</div>

<p>
Normally calling the accessor region-id would return an integer, but now it is
returning the name of the region. if you are using the dao as a simple way to
get the relevant data out of the database and you are just going to display
this value, this saves you from having to make additional database calls.
Otherwise, you would have to make an additional call to get the information
from all the foreign tables.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
